test-results/load-test-tools/NOT_RECOMMENDED/ab/nginx-status_n2000000_c200.log
- client: AWS c5.2xlarge * 1, 8C16G, 10Gbps
- server: AWS c5.2xlarge * 1, 8C16G, 10Gbps

$ ab -V
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/


$ ab -k -r -n 2000000 -c 200 -s 2 "http://172.31.10.3/nginx-status"

This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.31.10.3 (be patient)
Completed 200000 requests
Completed 400000 requests
Completed 600000 requests
Completed 800000 requests
Completed 1000000 requests
Completed 1200000 requests
Completed 1400000 requests
Completed 1600000 requests
Completed 1800000 requests
Completed 2000000 requests
Finished 2000000 requests


Server Software:        nginx
Server Hostname:        172.31.10.3
Server Port:            80

Document Path:          /nginx-status
Document Length:        113 bytes

Concurrency Level:      200
Time taken for tests:   10.692 seconds
Complete requests:      2000000
Failed requests:        0
Keep-Alive requests:    2000000
Total transferred:      540000000 bytes
HTML transferred:       226000000 bytes
Requests per second:    187064.23 [#/sec] (mean)
Time per request:       1.069 [ms] (mean)
Time per request:       0.005 [ms] (mean, across all concurrent requests)
Transfer rate:          49323.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       2
Processing:     0    1   0.2      1       2
Waiting:        0    1   0.2      1       2
Total:          0    1   0.2      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      2
  99%      2
 100%      4 (longest request)